Core/Helpers/Helpers.php

select `lang_value`, `lang_key` from `tl_translations` where `lang` = 'en'
---
function translate($key, $lang = null, $addslashes = false)
{
    if ($lang == null) {
        $lang = session()->get('locale');
    }


    $lang_key = preg_replace('/[^A-Za-z0-9\_]/', '', str_replace(' ', '_', strtolower($key)));

    $translations_en = Cache::rememberForever('translations-en', function () {
        return Translations::where('lang', 'en')->pluck('lang_value', 'lang_key')->toArray();

select `lang_value`, `lang_key` from `tl_theme_translations` where `lang` = 'en' and `theme` = 'default'
select `lang_value`, `lang_key` from `tl_theme_translations` where `lang` is null and `theme` = 'default'
---
function front_translate($key, $lang = null, $addslashes = false)
{
    $active_theme = getActiveTheme();

    if ($lang == null) {
        $lang = session()->get('api_locale');
    }

    $lang_key = trim($key);

    $translations_en = Cache::rememberForever('front-translations-en', function () use ($active_theme) {
        return ThemeTranslations::where('lang', 'en')->where('theme', $active_theme->location)->pluck('lang_value', 'lang_key')->toArray();
    });


    if (!isset($translations_en[$lang_key])) {
        $translation_def = new ThemeTranslations();
        $translation_def->lang = 'en';
        $translation_def->theme = $active_theme->location;
        $translation_def->lang_key = $lang_key;
        $translation_def->lang_value = $lang_key;
        $translation_def->save();
        cache_clear();
    }

    // return user session lang
    $translation_locale = Cache::rememberForever("front-translations-{$lang}", function () use ($lang, $active_theme) {
        return ThemeTranslations::where('lang', $lang)->where('theme', $active_theme->location)->pluck('lang_value', 'lang_key')->toArray();

select * from `roles` where `id` != 1
---
    function getAllRoleForAssign()
    {
        return DB::table('roles')
            ->where('id', '!=', 1)
            ->select(['*'])->get();

select exists(select * from `model_has_roles` where `model_id` = 10 and `role_id` = 4) as `exists`
---
    function userHasRole($user_id, $role_id)
    {
        return DB::table('model_has_roles')
            ->where('model_id', '=', $user_id)
            ->where('role_id', '=', $role_id)
            ->exists();

select * from `permissions`
---
    function getAllPermissions()
    {
        return Permission::all();

select `id`, `module_name`, `parent_module`, `module_type`, `location` from `permission_module` order by `permission_module`.`order` asc
select exists(select * from `tl_themes` where `location` = 'default') as `exists`
select * from `tl_themes` where `location` = 'default' limit 1
---
    function getPermissionsModules()
    {
        $active_theme = getActiveTheme();
        $modules = DB::table('permission_module')
            ->orderBy('permission_module.order')
            ->select([
                'id', 'module_name', 'parent_module', 'module_type', 'location'
            ])->get();

        $modules =  array_filter($modules->toArray(), function ($item) use ($active_theme) {
            if ($item->module_type == 'theme') {
                $theme_location =  $item->location;
                $theme = DB::table('tl_themes')->where('location', '=', $theme_location);
                if ($theme->exists()) {
                    return $theme->first()->id == $active_theme->id ? true : false;

select * from `permissions` where `module_id` = 28
---
    function getPermissionsOfModule($module_id)
    {
        return Permission::where('module_id', $module_id)->select('*')->get();

select exists(select * from `permissions` where `module_id` = 28 and `name` = 'Show Dashboard') as `exists`
select * from `permissions` where `module_id` = 28 and `name` = 'Manage Dashboard' limit 1
---
    function hasPermissionInThisModule($module_id, $permission_name)
    {
        $permissions = Permission::where('module_id', $module_id)
            ->where('name', '=', $permission_name);

        if ($permissions->exists()) {
            return $permissions->first()->id;

select * from `permissions` order by `created_at` desc limit 1
---
    function getLastPermissionId()
    {
        return Permission::latest()->first()->id;

select `tl_email_templates`.`module_name`, `tl_email_templates`.`id` as `template_id`, `tl_email_templates`.`name`, `tl_email_templates`.`details`, `tl_email_template_properties`.`subject`, `tl_email_template_properties`.`body` from `tl_email_templates` inner join `tl_email_template_properties` on `tl_email_template_properties`.`email_type` = `tl_email_templates`.`id`
---
    function getEcommerceEmailTemplates()
    {
        $templates = DB::table('tl_email_templates')
            ->join('tl_email_template_properties', 'tl_email_template_properties.email_type', '=', 'tl_email_templates.id')
            ->select([
                'tl_email_templates.module_name',
                'tl_email_templates.id as template_id',
                'tl_email_templates.name',
                'tl_email_templates.details',
                'tl_email_template_properties.subject',
                'tl_email_template_properties.body',
            ])->get();

select `tl_uploaded_files`.`path` as `placeholder_image`, `tl_uploaded_files`.`alt` as `placeholder_image_alt` from `tl_general_settings_has_values` left join `tl_uploaded_files` on `tl_uploaded_files`.`id` = `tl_general_settings_has_values`.`value` where `settings_id` = 274 limit 1
---
    function getPlaceHolderImage()
    {
        $default = new StdClass;
        $default->placeholder_image = null;
        $default->placeholder_image_alt = null;

        $data = DB::table('tl_general_settings_has_values')
            ->leftJoin('tl_uploaded_files', 'tl_uploaded_files.id', '=', 'tl_general_settings_has_values.value')
            ->where('settings_id', '=', getGeneralSettingId('placeholder_image'))
            ->select(['tl_uploaded_files.path as placeholder_image', 'tl_uploaded_files.alt as placeholder_image_alt'])
            ->first();

select `value` from `tl_general_settings_has_values` where `settings_id` = 275 limit 1
---
    function getChunkSize()
    {
        $data = DB::table('tl_general_settings_has_values')
            ->where('settings_id', '=', getGeneralSettingId('maximum_chunk_size'))
            ->first('value');

select `created_at` as `date` from `tl_uploaded_files` limit 1
select `created_at` as `date` from `tl_uploaded_files` order by `id` desc limit 1
---
    function getMonthsForUploadedFiles()
    {
        $startng_date = DB::table('tl_uploaded_files')
            ->select([
                'created_at as date'
            ])->first();

        $ending_date = DB::table('tl_uploaded_files')
            ->orderBy('id', 'desc')
            ->select([
                'created_at as date'
            ])->first();

select `id`, `code` from `tl_languages` where `id` = '1' limit 1
---
    function getDefaultLang()
    {
        $lang_id = getGeneralSetting('default_language');
        $lang = Cache::remember('default-lang', 3600, function() use ($lang_id){
            return Language::where('id', $lang_id)->select(['id','code'])->first();

select `path` from `tl_uploaded_files` where `tl_uploaded_files`.`id` = '1042' limit 1
---
    function getFilePath($id, $placeholder = true)
    {

        if (!$placeholder) {
            $file_path = Cache::rememberForever('file-path' . $id . '-' . $placeholder, function () use ($id) {
                $file_info = UploadedFile::select('path')->find($id);
                return $file_info != null ? fileStoragePath() . '/' . $file_info->path : null;
            });
        }

        if ($placeholder) {
            $file_path = Cache::rememberForever('file-path' . $id . '-' . $placeholder, function () use ($id) {
                $file_info = UploadedFile::select('path')->find($id);

select exists(select * from `tl_menu_translations` where `menu_id` = 489 and `lang` = '1') as `exists`
---
    function getTranslatedMenuTitle($menu_id, $lang_code, $translated_title)
    {
        if ($lang_code != null) {
            $menu = DB::table('tl_menu_translations')
                ->where('menu_id', '=', (int)$menu_id)
                ->where('lang', '=', $lang_code);


            if ($menu->exists()) {

select * from `tl_general_settings` where (`name` = 'default_language') limit 1
select * from `tl_general_settings_has_values` where `settings_id` = 281 limit 1
---
    function getGeneralSetting($settings_name, $has_multiple = NULL)
    {
        $setting = GeneralSettings::firstOrCreate(['name' => $settings_name]);
        if ($has_multiple != NULL) {
            return GeneralSettingsHasValue::where('settings_id', $setting->id)->pluck('value');
        } else {
            $value = GeneralSettingsHasValue::where('settings_id', $setting->id)->first();

select * from `tl_general_settings` where (`name` = 'placeholder_image') limit 1
---
    function getGeneralSettingId($settings_name)
    {
        $setting = GeneralSettings::firstOrCreate(['name' => $settings_name]);

select exists(select * from `tl_menu_positions` where `position` = 'Header Menu') as `exists`
select * from `tl_menu_positions` where `position` = 'Header Menu' limit 1
---
    function getMenuPositionId($position_name)
    {
        $menu_position = DB::table('tl_menu_positions')
            ->where('position', '=', $position_name);
        if (!$menu_position->exists()) {
            $active_theme = getActiveTheme();
            $position = new MenuPosition();
            $position->position = $position_name;
            $position->theme_id = $active_theme->id;
            $position->saveOrFail();
            return $position->id;
        }
        return $menu_position->first()->id;

select GROUP_CONCAT(distinct tl_pages.id) as id, GROUP_CONCAT(distinct tl_pages.title) as title, GROUP_CONCAT(distinct tl_pages.permalink) as permalink, GROUP_CONCAT(distinct tl_pages.page_image) as page_image from `tl_pages` inner join `tl_users` on `tl_users`.`id` = `tl_pages`.`user_id` where (`tl_pages`.`title` like '%%' or `tl_pages`.`visibility` like '%%' or `tl_pages`.`content` like '%%' or `tl_users`.`name` like '%%') group by `tl_pages`.`id` order by `tl_pages`.`id` desc
---
    function getPage($match_case = [], $search_key = '')
    {
        $pages = TlPage::join('tl_users', 'tl_users.id', '=', 'tl_pages.user_id')
            ->orderBy('tl_pages.id', 'desc')
            ->groupBy('tl_pages.id')
            ->where($match_case);

        $pages = $pages->where(function ($query) use ($search_key) {
            $query->where('tl_pages.title', 'like', '%' . $search_key . '%')
                ->orWhere('tl_pages.visibility', 'like', '%' . $search_key . '%')
                ->orWhere('tl_pages.content', 'like', '%' . $search_key . '%')
                ->orWhere('tl_users.name', 'like', '%' . $search_key . '%');
        });

        $pages = $pages->select(
            DB::raw('GROUP_CONCAT(distinct tl_pages.id) as id'),
            DB::raw('GROUP_CONCAT(distinct tl_pages.title) as title'),
            DB::raw('GROUP_CONCAT(distinct tl_pages.permalink) as permalink'),
            DB::raw('GROUP_CONCAT(distinct tl_pages.page_image) as page_image'),
        )->get();

select GROUP_CONCAT(distinct tl_blogs.id) as id from `tl_blogs` inner join `tl_users` on `tl_users`.`id` = `tl_blogs`.`user_id` left join `tl_blogs_categories` on `tl_blogs_categories`.`blog_id` = `tl_blogs`.`id` left join `tl_blog_categories` on `tl_blog_categories`.`id` = `tl_blogs_categories`.`category_id` where (`tl_blogs`.`name` like '%%' or `tl_blog_categories`.`name` like '%%' or `tl_blogs`.`content` like '%%' or `tl_users`.`name` like '%%') group by `tl_blogs`.`id` order by `tl_blogs`.`id` desc
---
    function getBlogCount($match_case = [], $search_key = '')
    {
        $blogs = DB::table('tl_blogs')
            ->join('tl_users', 'tl_users.id', '=', 'tl_blogs.user_id')
            ->leftJoin('tl_blogs_categories', 'tl_blogs_categories.blog_id', '=', 'tl_blogs.id')
            ->leftJoin('tl_blog_categories', 'tl_blog_categories.id', '=', 'tl_blogs_categories.category_id')
            ->groupBy('tl_blogs.id')
            ->orderBy('tl_blogs.id', 'desc')
            ->where($match_case);

        $blogs = $blogs->where(function ($query) use ($search_key) {
            $query->where('tl_blogs.name', 'like', '%' . $search_key . '%')
                ->orWhere('tl_blog_categories.name', 'like', '%' . $search_key . '%')
                ->orWhere('tl_blogs.content', 'like', '%' . $search_key . '%')
                ->orWhere('tl_users.name', 'like', '%' . $search_key . '%');
        });

        $blogs = $blogs->select([
            DB::raw('GROUP_CONCAT(distinct tl_blogs.id) as id'),
        ])->get();

select `tl_blog_categories`.`id`, `tl_blog_categories`.`name`, `tl_blog_categories`.`permalink`, `tl_blog_categories`.`icon`, `tl_uploaded_files`.`path`, `tl_uploaded_files`.`alt` from `tl_blog_categories` left join `tl_uploaded_files` on `tl_uploaded_files`.`id` = `tl_blog_categories`.`icon` where `tl_blog_categories`.`name` LIKE '%%' order by `tl_blog_categories`.`id` desc
---
    function getCategory($match_case = [], $search_key = '')
    {

        $categories = TlBlogCategory::where($match_case)->where('tl_blog_categories.name', 'LIKE', '%' . $search_key . '%')
            ->leftJoin('tl_uploaded_files', 'tl_uploaded_files.id', '=', 'tl_blog_categories.icon')
            ->select(
                'tl_blog_categories.id',
                'tl_blog_categories.name',
                'tl_blog_categories.permalink',
                'tl_blog_categories.icon',
                'tl_uploaded_files.path',
                'tl_uploaded_files.alt',
            )
            ->orderBy('tl_blog_categories.id', 'desc')->get();

select exists(select * from `tl_blog_categories` where `permalink` = 'uncategorized') as `exists`
---
    function createDefaultCategory()
    {
        $category = TlBlogCategory::where('permalink', 'uncategorized');
        if (!$category->exists()) {

select `id`, `code`, `native_name` from `tl_languages` where (`status` = 1)
---
    function getAllActiveLanguages()
    {
        return DB::table('tl_languages')
            ->where(['status' => config('settings.general_status.active')])
            ->select([
                'id', 'code', 'native_name'
            ])->get();

select * from `tl_uploaded_files` where `tl_uploaded_files`.`id` = '1039' limit 1
---
    function getImageVariation($id, $type = 'small')
    {
        $media = Cache::rememberForever('variation-file-' . $id, function () use ($id) {
            return UploadedFile::find($id);

select `name` from `tl_languages` where `code` = 'en' limit 1
---
    function getLanguageNameByCode($code)
    {
      $lang = Language::where('code',$code)->select('name')->first();