themes/default/helpers/helpers.php

select `tl_sidebar_has_widgets`.`id` as `sidebar_has_widget_id`, `tl_widgets`.`id` as `widget_id`, `tl_widgets`.`widget_name` from `tl_sidebar_has_widgets` inner join `tl_widgets` on `tl_widgets`.`id` = `tl_sidebar_has_widgets`.`widget_id` where `tl_sidebar_has_widgets`.`sidebar_id` = 8 order by `tl_sidebar_has_widgets`.`order` asc
---
    function getAllSidebarWidgets($sidebar_id)
    {
        $widgets = DB::table('tl_sidebar_has_widgets')
            ->join('tl_widgets', 'tl_widgets.id', '=', 'tl_sidebar_has_widgets.widget_id')
            ->where('tl_sidebar_has_widgets.sidebar_id', '=', $sidebar_id)
            ->select(
                'tl_sidebar_has_widgets.id as sidebar_has_widget_id',
                'tl_widgets.id as widget_id',
                'tl_widgets.widget_name',
            )
            ->orderBy('tl_sidebar_has_widgets.order', 'asc')
            ->get();

select `tl_theme_option_settings`.`option_name`, `tl_theme_option_settings`.`field_name`, `tl_theme_option_settings`.`field_value` from `tl_theme_option_settings` where `theme_id` = 16
---
    function getThemeOption($option_name, $active_theme_id)
    {
        $options = Cache::rememberForever('theme-option-settings', function () use ($active_theme_id) {
            return DB::table('tl_theme_option_settings')
                ->where('theme_id', $active_theme_id)
                ->select([
                    'tl_theme_option_settings.option_name',
                    'tl_theme_option_settings.field_name',
                    'tl_theme_option_settings.field_value'
                ])
                ->get();

select * from `tl_theme_sidebars` where (`sidebar_name` = 'Home Page Sidebar' and `theme_id` = 16) limit 1
---
    function getThemeSidebarId($sidebar_name)
    {
        $active_theme = getActiveTheme();
        $name = ucwords(str_replace('_', ' ', $sidebar_name));
        $sidebar = TlThemeSidebar::firstOrCreate(['sidebar_name' => $name, 'theme_id' => $active_theme->id]);

select * from `tl_sidebar_widget_has_values` where `sidebar_has_widget_id` = 790 limit 1
---
    function getSidebarWidgetValues($sidebar_has_widget_id, $lang)
    {
        $sidebar_widget_value = TlSidebarWidgetHasValue::where('sidebar_has_widget_id', $sidebar_has_widget_id)->first();

select * from `tl_languages` where `code` = 'en' limit 1
---
    function getActiveFrontLangRTL()
    {
        $rtl = false;
        $active_lang_code = getFrontLocale();
        $lang = Cache::rememberForever('active-frontend-lang', function () use ($active_lang_code) {
            return Language::where('code', $active_lang_code)->first();