Core/Http/Controllers/PageController.php

  public function addPage()
  {
    try {
      $data = [
        DB::raw('GROUP_CONCAT(distinct tl_pages.id) as id'),
        DB::raw('GROUP_CONCAT(distinct tl_pages.title) as title'),
        DB::raw('GROUP_CONCAT(distinct tl_pages.permalink) as permalink'),
        DB::raw('GROUP_CONCAT(distinct tl_pages.parent) as parent'),
      ];
      $match_case = [
        ['tl_pages.publish_status', '=',  config('settings.page_status.publish')],
        ['tl_pages.parent', '=',  null]
      ];
      $pages = $this->page_repository->getPages($data, $match_case)->get();
      $page_templates = $this->page_repository->getPageTemplates()->get();
---
select * from `tl_page_templates`