Core/Http/Controllers/RolePermissionController.php

    public function roles()
    {
        try {
            $roles = Role::all();
---
select * from `roles`