Core/Http/Controllers/ThemesController.php

select * from `tl_themes`
---
    public function index()
    {
        $themes = Themes::all();