Core/Http/Controllers/UserController.php

    public function users()
    {
        try {
            $data = [
                'tl_users.*',
                'tl_uploaded_files.path as pro_pic',
                'tl_uploaded_files.alt as alt'
            ];
            $users = $this->user_repository->getUserProfileInfo($data)->get();
            foreach ($users as $u) {
                $userModel = User::find($u->id);
---
select `tl_users`.*, `tl_uploaded_files`.`path` as `pro_pic`, `tl_uploaded_files`.`alt` as `alt` from `tl_users` left join `tl_uploaded_files` on `tl_uploaded_files`.`id` = `tl_users`.`image`
select * from `tl_users` where `tl_users`.`id` = 1 limit 1

    public function updateUserStatus(Request $request)
    {
        try {
            $user = User::findOrFail($request['id']);
            $user->status = $request['status'];
            $user->update();
---
select * from `tl_users` where `tl_users`.`id` = '10' limit 1
update `tl_users` set `status` = '2', `tl_users`.`updated_at` = '2023-07-06 08:45:00' where `id` = 10

    public function deleteUser(Request $request)
    {
        try {
            $user = User::findOrFail($request['id']);
            $user->delete();
---
select * from `tl_users` where `tl_users`.`id` = '9' limit 1
delete from `tl_users` where `id` = 9